soap_bak/DeviceBinding.DeleteGeoLocation.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:xmime="http://tempuri.org/xmime.xsd"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:tds="http://www.onvif.org/ver10/device/wsdl">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <tds:DeleteGeoLocation>
    <tds:Location Entity="" Token="" Fixed="false" GeoSource="http://www.example.com/schema/anyURI" AutoGeo="false">
     <tt:GeoLocation lon="0.0" lat="0.0" elevation="0.0">
     </tt:GeoLocation>
     <tt:GeoOrientation roll="0.0" pitch="0.0" yaw="0.0">
     </tt:GeoOrientation>
     <tt:LocalLocation x="0.0" y="0.0" z="0.0">
     </tt:LocalLocation>
     <tt:LocalOrientation pan="0.0" tilt="0.0" roll="0.0">
     </tt:LocalOrientation>
    </tds:Location>
   </tds:DeleteGeoLocation>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
